Repository: Spakeyvr/ChatLLM
Catalog: ChatLLM/Localizable.xcstrings
Source language: en
Languages: de, es

source: No analysis results were generated.
de: Es wurden keine Analyseergebnisse erstellt.
es: No se han generado resultados del análisis.

source: No Chats Yet
de: Noch keine Chats
es: Aún no hay chats

source: No files found for this model on HuggingFace.
de: Für dieses Modell wurden keine Dateien auf HuggingFace gefunden.
es: No se han encontrado archivos para este modelo en HuggingFace.

source: No matching chats
de: Keine passenden Chats
es: No hay chats que coincidan

source: No messages yet
de: Noch keine Nachrichten
es: Aún no hay mensajes

source: No MLX model is loaded. Select the MLX backend and wait for the model to finish loading.
de: Kein MLX-Modell geladen. Wähle das MLX-Backend und warte, bis das Modell geladen ist.
es: No hay ningún modelo MLX cargado. Selecciona el motor MLX y espera a que termine de cargar.

source: No raw output captured for this message.
de: Für diese Nachricht wurde keine Rohausgabe erfasst.
es: No se ha registrado la salida sin procesar de este mensaje.

source: No reasoning content available.
de: Keine Gedankengänge verfügbar.
es: No hay razonamiento disponible.

source: No relevant web results were found.
de: Keine relevanten Webergebnisse gefunden.
es: No se han encontrado resultados web relevantes.

source: No Sources
de: Keine Quellen
es: Sin fuentes

source: Not Available
de: Nicht verfügbar
es: No disponible

source: Not Set
de: Nicht festgelegt
es: Sin definir

source: Not supported
de: Nicht unterstützt
es: No compatible

source: Object detection failed: %@
de: Objekterkennung fehlgeschlagen: %@
es: Error en la detección de objetos: %@

source: Older
de: Älter
es: Anteriores

source: On-Device Models
de: Modelle auf dem Gerät
es: Modelos en el dispositivo

source: On‑device model unavailable on this device.
de: Auf diesem Gerät ist kein geräteinternes Modell verfügbar.
es: El modelo local no está disponible en este dispositivo.

source: Opens the website
de: Öffnet die Website
es: Abre el sitio web

source: Optional setup for larger fully local models.
de: Optionale Einrichtung größerer, vollständig lokaler Modelle.
es: Configuración opcional de modelos más grandes y totalmente locales.

source: Optional setup for web search.
de: Optionale Einrichtung der Websuche.
es: Configuración opcional de la búsqueda web.

source: Overview
de: Übersicht
es: Resumen

source: Package
de: Paket
es: Paquete

source: Parameters
de: Parameter
es: Parámetros

source: Paste a Tavily API key if you want web search. You can also skip this and use the rest of the app normally.
de: Füge einen Tavily-API-Schlüssel ein, um die Websuche zu nutzen. Du kannst diesen Schritt auch überspringen und die App normal verwenden.
es: Pega una clave de API de Tavily si quieres buscar en la web. También puedes omitir este paso y usar el resto de la app con normalidad.

source: Penalty
de: Strafwert
es: Penalización

source: Permanently delete conversations and their attachments from this device.
de: Löscht Chats und ihre Anhänge dauerhaft von diesem Gerät.
es: Elimina permanentemente los chats y sus archivos adjuntos de este dispositivo.

source: Photo Import Failed
de: Fotoimport fehlgeschlagen
es: Error al importar la foto

source: Photos
de: Fotos
es: Fotos

source: Preparing chat…
de: Chat wird vorbereitet…
es: Preparando chat…

source: Privacy & Data
de: Datenschutz & Daten
es: Privacidad y datos

source: Provider
de: Anbieter
es: Proveedor

source: Qwen 3.5 0.8B multimodal model with native reasoning and vision.
de: Multimodales Qwen 3.5 0.8B-Modell mit nativem Denkmodus und Bilderkennung.
es: Modelo multimodal Qwen 3.5 0.8B con razonamiento y visión nativos.

source: Qwen 3.5 2B multimodal model with native reasoning and vision.
de: Multimodales Qwen 3.5 2B-Modell mit nativem Denkmodus und Bilderkennung.
es: Modelo multimodal Qwen 3.5 2B con razonamiento y visión nativos.

source: Qwen 3.5 4B multimodal model with native reasoning and vision.
de: Multimodales Qwen 3.5 4B-Modell mit nativem Denkmodus und Bilderkennung.
es: Modelo multimodal Qwen 3.5 4B con razonamiento y visión nativos.

source: Raw chars
de: Zeichen der Rohausgabe
es: Caracteres sin procesar

source: Raw Output
de: Rohausgabe
es: Salida sin procesar

source: Reasoning
de: Nachdenken
es: Razonamiento

source: Reasoning (Always On)
de: Nachdenken (immer aktiv)
es: Razonamiento (siempre activo)

source: Reasoning by Default
de: Standardmäßig nachdenken
es: Razonar por defecto

source: Reasoning mode
de: Denkmodus
es: Modo de razonamiento

source: Reduce Repetition
de: Wiederholungen reduzieren
es: Reducir repeticiones

source: Regenerate
de: Neu generieren
es: Regenerar

source: Release Channel
de: Release-Kanal
es: Canal de versiones

source: Remove
de: Entfernen
es: Quitar

source: Remove API Key
de: API-Schlüssel entfernen
es: Quitar clave de API

source: Remove API Key?
de: API-Schlüssel entfernen?
es: ¿Quitar la clave de API?

source: Rename
de: Umbenennen
es: Cambiar nombre

source: Rename Chat
de: Chat umbenennen
es: Cambiar nombre del chat

source: Repetition Penalty
de: Wiederholungsstrafe
es: Penalización por repetición

source: Reset
de: Zurücksetzen
es: Restablecer

source: Reset All Settings
de: Alle Einstellungen zurücksetzen
es: Restablecer todos los ajustes

source: Reset All Settings?
de: Alle Einstellungen zurücksetzen?
es: ¿Restablecer todos los ajustes?

source: Reset Text Size
de: Textgröße zurücksetzen
es: Restablecer tamaño del texto

source: Response Preferences
de: Antwortvorgaben
es: Preferencias de respuesta

source: Restore default preferences and remove the saved web search key. Chats and downloaded models are kept.
de: Stellt die Standardeinstellungen wieder her und entfernt den gespeicherten Websuchschlüssel. Chats und heruntergeladene Modelle bleiben erhalten.
es: Restaura las preferencias predeterminadas y elimina la clave de búsqueda web guardada. Se conservan los chats y los modelos descargados.

source: Retry
de: Erneut versuchen
es: Reintentar

source: RotorQuant Experimental
de: RotorQuant (experimentell)

source: RotorQuant is very early and in beta. It can reduce KV-cache memory, but speed and stability are still being tuned.
de: RotorQuant befindet sich in einer sehr frühen Beta-Phase. Es kann den Speicherbedarf des KV-Caches verringern, aber Geschwindigkeit und Stabilität werden noch verbessert.
es: RotorQuant está en una fase beta muy inicial. Puede reducir la memoria de la caché KV, pero la velocidad y la estabilidad aún se están ajustando.

source: Run bigger local models
de: Größere lokale Modelle nutzen
es: Ejecuta modelos locales más grandes

source: Save
de: Sichern
es: Guardar

source: Saved web search
de: Gespeicherte Websuche
es: Búsqueda web guardada

source: Search chats
de: Chats durchsuchen
es: Buscar chats

source: Search could not be completed.
de: Die Suche konnte nicht abgeschlossen werden.
es: No se ha podido completar la búsqueda.

source: Search query
de: Suchanfrage
es: Consulta de búsqueda

source: Search Results
de: Suchergebnisse
es: Resultados de búsqueda

source: Search was explicitly required for this response, but every webSearch attempt failed.
de: Für diese Antwort ist eine Suche erforderlich, aber alle webSearch-Versuche sind fehlgeschlagen.
es: Esta respuesta requiere una búsqueda, pero todos los intentos de webSearch han fallado.

source: Search was explicitly required for this response, but the model did not call the webSearch tool.
de: Für diese Antwort ist eine Suche erforderlich, aber das Modell hat das webSearch-Tool nicht aufgerufen.
es: Esta respuesta requiere una búsqueda, pero el modelo no ha usado la herramienta webSearch.

source: Search when needed
de: Bei Bedarf suchen
es: Busca cuando lo necesites

source: Searched the web
de: Web durchsucht
es: Búsqueda web completada

source: Searching the web
de: Web wird durchsucht
es: Buscando en la web

source: Select a Conversation
de: Chat auswählen
es: Selecciona un chat

source: Select Model
de: Modell auswählen
es: Seleccionar modelo

source: Selected MLX model '%@' is no longer known. Choose another model.
de: Das gewählte MLX-Modell „%@“ ist nicht mehr bekannt. Wähle ein anderes Modell.
es: El modelo MLX seleccionado «%@» ya no se reconoce. Elige otro modelo.

source: Selected MLX model is not loaded. Wait for it to load or choose another backend.
de: Das gewählte MLX-Modell ist nicht geladen. Warte, bis es geladen ist, oder wähle ein anderes Backend.
es: El modelo MLX seleccionado no está cargado. Espera a que se cargue o elige otro motor.

source: Send
de: Senden
es: Enviar

source: Send on Return
de: Mit Eingabetaste senden
es: Enviar con Intro

source: Set Up
de: Einrichten
es: Configurar

source: Settings
de: Einstellungen
es: Ajustes

source: Share
de: Teilen
es: Compartir

source: Shorter responses usually use less memory and finish sooner. Unlimited removes the output cap.
de: Kürzere Antworten benötigen meist weniger Speicher und sind schneller fertig. Unbegrenzt hebt das Ausgabelimit auf.
es: Las respuestas más cortas suelen usar menos memoria y terminar antes. Sin límite elimina el tope de salida.

source: Show Chats
de: Chats anzeigen
es: Mostrar chats

source: Show Output Stats
de: Ausgabestatistik anzeigen
es: Mostrar estadísticas de salida

source: Shows the sources used for this response
de: Zeigt die Quellen für diese Antwort
es: Muestra las fuentes de esta respuesta

source: Skip
de: Überspringen
es: Omitir

source: Smart Reasoning
de: Intelligentes Nachdenken
es: Razonamiento inteligente

source: Source image not found for inference variant
de: Das Quellbild für die Inferenzvariante wurde nicht gefunden
es: No se ha encontrado la imagen original para la variante de inferencia

source: Sources
de: Quellen
es: Fuentes

source: Standard package
de: Standardpaket
es: Paquete estándar

source: Start a New Chat
de: Neuen Chat starten
es: Iniciar un chat nuevo

source: Start a new chat to see it here.
de: Starte einen neuen Chat, um ihn hier zu sehen.
es: Inicia un chat nuevo para verlo aquí.

source: Start Fresh
de: Neu beginnen
es: Empezar de cero

source: Start instantly
de: Sofort loslegen
es: Empieza al instante

source: Start new chats with reasoning enabled on supported models. Response preferences tell the assistant how you like answers written; existing chats keep their original preferences.
de: Startet neue Chats mit aktiviertem Denkmodus bei unterstützten Modellen. Antwortvorgaben legen fest, wie der Assistent antworten soll. Bestehende Chats behalten ihre ursprünglichen Vorgaben.
es: Inicia los chats nuevos con el razonamiento activado en los modelos compatibles. Las preferencias indican al asistente cómo quieres las respuestas; los chats existentes conservan sus preferencias originales.

source: Start with one thing that matters. Break it into small steps, and take them one at a time.
de: Beginne mit einer wichtigen Sache. Teile sie in kleine Schritte auf und gehe sie nacheinander an.
es: Empieza por algo que importe. Divídelo en pasos pequeños y ve uno a uno.

source: Started
de: Gestartet
es: Iniciado

source: Stats
de: Statistik
es: Estadísticas

source: Stop
de: Stoppen
es: Detener

source: Supported
de: Unterstützt
es: Compatible

source: System follows your device’s appearance.
de: System übernimmt die Darstellung deines Geräts.
es: Sistema sigue la apariencia del dispositivo.

source: Tap the + button to create your first conversation
de: Tippe auf +, um deinen ersten Chat zu starten
es: Pulsa + para crear tu primer chat

source: Tavily API Key
de: Tavily-API-Schlüssel
es: Clave de API de Tavily

source: Tavily is optional
de: Tavily ist optional
es: Tavily es opcional

source: Tavily returned a response ChatLLM could not read.
de: Tavily hat eine Antwort geliefert, die ChatLLM nicht lesen konnte.
es: Tavily ha devuelto una respuesta que ChatLLM no ha podido leer.

source: Technical Details
de: Technische Details
es: Detalles técnicos

source: Test Key
de: Schlüssel prüfen
es: Probar clave

source: The app works right away with Apple Foundation Models when your device supports them.
de: Die App funktioniert sofort mit Apple Foundation Models, wenn dein Gerät diese unterstützt.
es: La app funciona al instante con Apple Foundation Models si tu dispositivo es compatible.

source: The background model download lost its destination information.
de: Dem Modell-Download im Hintergrund fehlen die Zielinformationen.
es: La descarga del modelo en segundo plano ha perdido la información de destino.

source: The MLX chat history is empty, so generation cannot start.
de: Der MLX-Chatverlauf ist leer. Die Generierung kann nicht starten.
es: El historial del chat MLX está vacío, por lo que no se puede iniciar la generación.

source: The model emitted a tool call, but no MLX tool dispatcher was configured.
de: Das Modell hat einen Tool-Aufruf ausgegeben, aber es ist kein MLX-Tool-Dispatcher konfiguriert.
es: El modelo ha emitido una llamada a una herramienta, pero no se ha configurado un gestor de herramientas MLX.

source: The model hasn't finished loading.
de: Das Modell ist noch nicht vollständig geladen.
es: El modelo aún no ha terminado de cargar.

source: The model returned an empty response. Try regenerating or rephrasing.
de: Das Modell hat eine leere Antwort geliefert. Versuche es erneut oder formuliere deine Frage um.
es: El modelo ha devuelto una respuesta vacía. Prueba a regenerarla o a reformular la pregunta.

source: The model server returned an unexpected response.
de: Der Modellserver hat eine unerwartete Antwort geliefert.
es: El servidor de modelos ha devuelto una respuesta inesperada.

source: The model server returned HTTP %lld.
de: Der Modellserver hat HTTP %lld zurückgegeben.
es: El servidor de modelos ha devuelto HTTP %lld.

source: The provided image is invalid or cannot be processed.
de: Das Bild ist ungültig oder kann nicht verarbeitet werden.
es: La imagen proporcionada no es válida o no se puede procesar.

source: The selected file is not a valid image.
de: Die ausgewählte Datei ist kein gültiges Bild.
es: El archivo seleccionado no es una imagen válida.

source: The selected MLX model isn't ready. %@ Try waiting for it to load, or switch to Apple Intelligence in Settings.
de: Das gewählte MLX-Modell ist noch nicht bereit. %@ Warte, bis es geladen ist, oder wechsle in den Einstellungen zu Apple Intelligence.
es: El modelo MLX seleccionado aún no está listo. %@ Espera a que se cargue o cambia a Apple Intelligence en los ajustes.

source: The server returned an unexpected file path for: %@
de: Der Server hat einen unerwarteten Dateipfad geliefert für: %@
es: El servidor ha devuelto una ruta de archivo inesperada para: %@

source: The server returned an unexpected response. Check your internet connection.
de: Der Server hat eine unerwartete Antwort geliefert. Prüfe deine Internetverbindung.
es: El servidor ha devuelto una respuesta inesperada. Comprueba tu conexión a internet.

source: The Tavily API key is missing or invalid.
de: Der Tavily-API-Schlüssel fehlt oder ist ungültig.
es: La clave de API de Tavily falta o no es válida.

source: Thinking…
de: Denke nach…
es: Pensando…

source: This is optional. You can finish onboarding right now, or start a model download and continue using the app while it runs.
de: Dies ist optional. Du kannst die Einführung jetzt abschließen oder ein Modell herunterladen und die App währenddessen weiterverwenden.
es: Este paso es opcional. Puedes terminar la introducción ahora o iniciar la descarga de un modelo y seguir usando la app mientras se descarga.

source: This restores all preferences, clears response preferences, and removes the saved web search key. Chats and downloaded models will not be deleted.
de: Setzt alle Einstellungen zurück, löscht Antwortvorgaben und entfernt den gespeicherten Websuchschlüssel. Chats und heruntergeladene Modelle werden nicht gelöscht.
es: Restablece todos los ajustes, borra las preferencias de respuesta y elimina la clave de búsqueda web guardada. No se eliminarán los chats ni los modelos descargados.

source: This search did not return a readable source.
de: Diese Suche hat keine lesbare Quelle geliefert.
es: Esta búsqueda no ha devuelto ninguna fuente legible.

source: This will permanently delete %@ %@ from your device.
de: %@ %@ wird dauerhaft von deinem Gerät gelöscht.
es: Se eliminará permanentemente %@ %@ de tu dispositivo.

source: Thought
de: Nachgedacht
es: Razonamiento completado

source: Thought for %@
de: %@ nachgedacht
es: Razonamiento durante %@

source: Today
de: Heute
es: Hoy

source: Try adjusting your search terms
de: Versuche andere Suchbegriffe
es: Prueba con otros términos de búsqueda

source: Try again
de: Erneut versuchen
es: Intentar de nuevo

source: Unable to create thumbnail for inference variant
de: Die Miniaturansicht für die Inferenzvariante konnte nicht erstellt werden
es: No se ha podido crear la miniatura para la variante de inferencia

source: Unable to encode inference variant
de: Die Inferenzvariante konnte nicht kodiert werden
es: No se ha podido codificar la variante de inferencia

source: Unable to read image source for inference variant
de: Das Quellbild für die Inferenzvariante konnte nicht gelesen werden
es: No se ha podido leer la imagen original para la variante de inferencia

source: Unknown
de: Unbekannt
es: Desconocido

source: Unlimited Output
de: Unbegrenzte Ausgabe
es: Salida sin límite

source: Untitled
de: Ohne Titel
es: Sin título

source: Untitled Chat
de: Unbenannter Chat
es: Chat sin título

source: Visible chars
de: Sichtbare Zeichen
es: Caracteres visibles

source: Vision analysis failed to complete.
de: Die Bildanalyse konnte nicht abgeschlossen werden.
es: No se ha podido completar el análisis de la imagen.

source: Waiting for results…
de: Warte auf Ergebnisse…
es: Esperando resultados…

source: Web Search
de: Websuche
es: Búsqueda web

source: Web search and tool calls for %@ require an iPhone with at least %@ GB of RAM.
de: Websuche und Tool-Aufrufe für %@ benötigen ein iPhone mit mindestens %@ GB RAM.
es: La búsqueda web y las llamadas a herramientas de %@ requieren un iPhone con al menos %@ GB de RAM.

source: Web search failed
de: Websuche fehlgeschlagen
es: Error en la búsqueda web

source: Web search failed: %@
de: Websuche fehlgeschlagen: %@
es: Error en la búsqueda web: %@

source: Web search was explicitly required for this response, but no search tool is configured. Add a Tavily API key.
de: Für diese Antwort ist eine Websuche erforderlich, aber es ist kein Suchtool eingerichtet. Füge einen Tavily-API-Schlüssel hinzu.
es: Esta respuesta requiere una búsqueda web, pero no hay ninguna herramienta de búsqueda configurada. Añade una clave de API de Tavily.

source: Web search was explicitly required for this response, but tool calls are disabled. Re-enable tool calls or turn off forced web search.
de: Für diese Antwort ist eine Websuche erforderlich, aber Tool-Aufrufe sind deaktiviert. Aktiviere Tool-Aufrufe oder deaktiviere die erzwungene Websuche.
es: Esta respuesta requiere una búsqueda web, pero las llamadas a herramientas están desactivadas. Actívalas o desactiva la búsqueda web obligatoria.

source: Web search will be unavailable until you add a key again.
de: Die Websuche ist erst wieder verfügbar, wenn du einen Schlüssel hinzufügst.
es: La búsqueda web no estará disponible hasta que vuelvas a añadir una clave.

source: Web searches send queries to Tavily. Local chats do not need an API key.
de: Websuchen senden Suchanfragen an Tavily. Lokale Chats benötigen keinen API-Schlüssel.
es: Las búsquedas web envían consultas a Tavily. Los chats locales no necesitan una clave de API.

source: Welcome to ChatLLM
de: Willkommen bei ChatLLM
es: Te damos la bienvenida a ChatLLM

source: Yesterday
de: Gestern
es: Ayer

source: You can finish onboarding now and keep using the app while this continues.
de: Du kannst die Einführung jetzt abschließen und die App währenddessen weiterverwenden.
es: Puedes terminar la introducción ahora y seguir usando la app mientras continúa.

source: You can optionally download MLX models for fully local chats, reasoning, and native image support.
de: Du kannst optional MLX-Modelle für vollständig lokale Chats, Denkfunktionen und native Bildunterstützung herunterladen.
es: Puedes descargar modelos MLX para chats totalmente locales, razonamiento y compatibilidad nativa con imágenes.

source: Your existing key is unchanged until you tap Save.
de: Dein bisheriger Schlüssel bleibt unverändert, bis du auf Sichern tippst.
es: Tu clave actual no cambia hasta que pulses Guardar.

source: Your key is stored in Keychain and sent to Tavily only to authenticate web searches.
de: Dein Schlüssel wird im Schlüsselbund gespeichert und nur zur Authentifizierung von Websuchen an Tavily gesendet.
es: Tu clave se guarda en el llavero y solo se envía a Tavily para autenticar las búsquedas web.

source: Backend
es: Motor

source: Build
es: Compilación

source: HF Repository
es: Repositorio de HF

source: Name
es: Nombre

source: OK
es: Aceptar

source: Status
es: Estado

source: Support
es: Ayuda

source: System
es: Sistema

source: Version
es: Versión
